loadTesting/postProduction.yml
config:
  target: 'http://52.53.162.141:3000'
  processor: "./artillery-generate-functions.js"
  phases:
    - duration: 20
      arrivalRate: 5
  defaults:
    headers:
      'Content-Type' : application/json
scenarios:
  - flow:
      - loop:
          - function: "generateMarketData"
          - post:
              url: "/market"
              json: {"areacode" : "{{ areacode3 }}", "drivers": "{{ drivers }}", "riders": "{{ riders }}" }
        count: 5